Q1. List any five functions of the pandas library with execution.

In [7]:
import pandas as pd
df= pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

print(df.describe())
print(df.info())
print(df["Survived"].value_counts())
print(df.loc[0:2,['PassengerId']])
print(df.iloc[0:2,[0,1,2]])

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
0    549
1    342
Name: Survived, dtype: int64
   PassengerId
0            1
1            2
2            3
   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [25]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'],'C':['!','@','#','$','%']})
n=len(df)*2
new_index=pd.RangeIndex(start=1, stop=n, step=2)
df.index=new_index
df

   A  B  C
1  1  a  !
3  2  b  @
5  3  c  #
7  4  d  $
9  5  e  %

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [31]:
df=pd.DataFrame({"Value":[10,20,30,40,50]})
df[df.index<3].sum()

Value    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [43]:
df=pd.DataFrame({"Text":["Through the dense forest, a lone wolf howled at the silver moon above. Leaves rustled as a gentle breeze whispered secrets to the night. Stars sparkled, painting the sky with their ethereal glow. Nature's symphony played, filling the air with harmony. In this enchanting moment, magic embraced the world."]})
pd.set_option("display.max_colwidth" ,80)
df["Word_Count"]=df["Text"].apply(lambda x:len(x.split()))
df

,Text,Word_Count
0,"Through the dense forest, a lone wolf howled at the silver moon above. Leave...",49

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
"""DataFrame.size() returns the total number of elements in a DataFrame.
   DataFrame.shape() returns a tuple representing the dimensions of the DataFrame."""

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
"""pandas.read_excel(data.xlsx) : function use to read Excel file"

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [7]:
import pandas as pd

data={"Email":["oconnell.adelle@hessel.com","luettgen.conor@hotmail.com","balistreri.marianna@monahan.com",
"dorothea81@gmail.com","gust54@yahoo.com","qwitting@gmail.com","leonie79@yahoo.com","makayla06@gmail.com",
               "lenora20@monahan.net","juanita.armstrong@botsford.com"]}

df=pd.DataFrame(data)
df["Username"]=df["Email"].apply(lambda x: x.split("@")[0])
df

                             Email             Username
0       oconnell.adelle@hessel.com      oconnell.adelle
1       luettgen.conor@hotmail.com       luettgen.conor
2  balistreri.marianna@monahan.com  balistreri.marianna
3             dorothea81@gmail.com           dorothea81
4                 gust54@yahoo.com               gust54
5               qwitting@gmail.com             qwitting
6               leonie79@yahoo.com             leonie79
7              makayla06@gmail.com            makayla06
8             lenora20@monahan.net             lenora20
9   juanita.armstrong@botsford.com    juanita.armstrong

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.


For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

In [14]:
data={"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]}

df=pd.DataFrame(data)

df[(df["A"]>5) & (df["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2